
## :x: Apply Failed

[CI link](https://github.com/kanade0404/zaim/actions/runs/11082813621)



<pre><code>Error: Error waiting for Updating Service: Error code 13, message: Revision &#39;zaim-api-00059-g7g&#39; is not ready and cannot serve traffic. Image &#39;asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app&#39; not found.

  with google_cloud_run_v2_service.app,
  on main.tf line 95, in resource &#34;google_cloud_run_v2_service&#34; &#34;app&#34;:
  95: resource &#34;google_cloud_run_v2_service&#34; &#34;app&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
random_uuid.uuid: Refreshing state... [id=a3f45806-e1b9-0a03-6343-8c5ef3ef14b1]
module.zaim-consumer-key["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-key-SHARED]
module.zaim-func.google_service_account.account: Refreshing state... [id=projects/kanade0404/serviceAccounts/zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-oauth-secret["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-secret-SEIYA]
module.zaim-consumer-key["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-key-SEIYA]
module.zaim-oauth-secret["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-secret-SHARED]
module.zaim-oauth-token["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-token-SEIYA]
module.zaim-csv-folder["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/csv-folder-SHARED]
module.zaim-csv-folder["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/csv-folder-SEIYA]
module.zaim-oauth-token["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-oauth-token-SHARED]
google_artifact_registry_repository.repo: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/repositories/zaim-api]
module.zaim-file.google_storage_bucket.bucket: Refreshing state... [id=zaim-kanade0404-a3f45806-e1b9-0a03-6343-8c5ef3ef14b1]
module.zaim-consumer-secret["SHARED"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-secret-SHARED]
module.zaim-consumer-secret["SEIYA"].google_secret_manager_secret.secret: Refreshing state... [id=projects/kanade0404/secrets/zaim-consumer-secret-SEIYA]
module.zaim-func.google_project_iam_member.iam["secretmanager.secretAccessor"]: Refreshing state... [id=kanade0404/roles/secretmanager.secretAccessor/serviceAccount:zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-csv-folder["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/csv-folder-SHARED/versions/1]
module.zaim-csv-folder["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/csv-folder-SEIYA/versions/1]
module.zaim-func.google_project_iam_member.iam["storage.objectUser"]: Refreshing state... [id=kanade0404/roles/storage.objectUser/serviceAccount:zaim-func@kanade0404.iam.gserviceaccount.com]
module.zaim-consumer-key["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-key-SHARED/versions/1]
module.zaim-consumer-key["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-key-SEIYA/versions/1]
module.zaim-oauth-secret["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-secret-SHARED/versions/1]
module.zaim-oauth-secret["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-secret-SEIYA/versions/1]
module.zaim-oauth-token["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-token-SHARED/versions/1]
module.zaim-oauth-token["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-oauth-token-SEIYA/versions/1]
module.zaim-consumer-secret["SHARED"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-secret-SHARED/versions/1]
module.zaim-consumer-secret["SEIYA"].google_secret_manager_secret_version.secret-version: Refreshing state... [id=projects/137094135185/secrets/zaim-consumer-secret-SEIYA/versions/1]
google_cloud_run_v2_service.app: Preparing import... [id=asia-northeast1/zaim-api]
google_cloud_run_v2_service.app: Refreshing state... [id=projects/kanade0404/locations/asia-northeast1/services/zaim-api]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service.app will be updated in-place
  # (imported from "asia-northeast1/zaim-api")
  ~ resource "google_cloud_run_v2_service" "app" {
        annotations             = {}
        client                  = "gcloud"
        client_version          = "493.0.0"
        conditions              = [
            {
                execution_reason     = null
                last_transition_time = "2024-09-23T13:37:33.320635Z"
                message              = null
                reason               = null
                revision_reason      = null
                severity             = null
                state                = "CONDITION_SUCCEEDED"
                type                 = "RoutesReady"
            },
            {
                execution_reason     = null
                last_transition_time = "2023-12-10T03:20:40.405302Z"
                message              = null
                reason               = null
                revision_reason      = null
                severity             = null
                state                = "CONDITION_SUCCEEDED"
                type                 = "ConfigurationsReady"
            },
        ]
        create_time             = "2023-12-10T03:20:40.210552Z"
        creator                 = "github-actions@kanade0404.iam.gserviceaccount.com"
        custom_audiences        = []
        delete_time             = null
        deletion_protection     = true
        description             = null
        effective_annotations   = {}
        effective_labels        = {
            "service" = "zaim"
        }
        etag                    = "\"CJbexbcGEKjhxrAD/cHJvamVjdHMva2FuYWRlMDQwNC9sb2NhdGlvbnMvYXNpYS1ub3J0aGVhc3QxL3NlcnZpY2VzL3phaW0tYXBp\""
        expire_time             = null
        generation              = "63"
        id                      = "projects/kanade0404/locations/asia-northeast1/services/zaim-api"
        ingress                 = "INGRESS_TRAFFIC_ALL"
        labels                  = {}
        last_modifier           = "github-actions@kanade0404.iam.gserviceaccount.com"
        latest_created_revision = "projects/kanade0404/locations/asia-northeast1/services/zaim-api/revisions/zaim-api-00058-dzm"
        latest_ready_revision   = "projects/kanade0404/locations/asia-northeast1/services/zaim-api/revisions/zaim-api-00058-dzm"
        launch_stage            = "GA"
        location                = "asia-northeast1"
        name                    = "zaim-api"
        observed_generation     = "63"
        project                 = "kanade0404"
        reconciling             = false
        terminal_condition      = [
            {
                execution_reason     = null
                last_transition_time = "2024-09-23T13:37:33.349976Z"
                message              = null
                reason               = null
                revision_reason      = null
                severity             = null
                state                = "CONDITION_SUCCEEDED"
                type                 = "Ready"
            },
        ]
      ~ terraform_labels        = {
          + "service" = "zaim"
        }
        traffic_statuses        = [
            {
                percent  = 100
                revision = null
                tag      = null
                type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
                uri      = null
            },
        ]
        uid                     = "efa03a39-8346-46bb-ab73-d9f5358332ec"
        update_time             = "2024-09-23T13:37:26.907129Z"
        uri                     = "https://zaim-api-vr35tgknva-an.a.run.app"

      ~ template {
            annotations                      = {}
            encryption_key                   = null
            execution_environment            = null
            labels                           = {}
            max_instance_request_concurrency = 80
            revision                         = null
            service_account                  = "zaim-func@kanade0404.iam.gserviceaccount.com"
            session_affinity                 = false
            timeout                          = "300s"

          ~ containers {
                args        = []
                command     = []
                depends_on  = []
              ~ image       = "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app:88c907a40bfac20d09d7ebdf2e7d14a17b67169e" -> "asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app"
                name        = "app-1"
                working_dir = null

                env {
                    name  = "BUCKET_NAME"
                    value = "zaim-kanade0404-a3f45806-e1b9-0a03-6343-8c5ef3ef14b1"
                }
              - env {
                  - name  = "DATABASE_URL" -> null
                  - value = "postgresql://postgres.ylzvovjxutzphannzduw:DBl9TZBht7DGnjVH@aws-0-ap-northeast-1.pooler.supabase.com:6543/postgres" -> null
                }
                env {
                    name  = "ENV"
                    value = "prd"
                }
                env {
                    name  = "HOST"
                    value = "https://zaim-api-vr35tgknva-an.a.run.app"
                }
                env {
                    name  = "PROJECT_ID"
                    value = "kanade0404"
                }
              + env {
                  + name  = "DATABASE_URL"
                    value = null

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-url"
                          + version = (known after apply)
                        }
                    }
                }

                ports {
                    container_port = 8888
                    name           = "http1"
                }

                resources {
                    cpu_idle          = true
                    limits            = {
                        "cpu"    = "1000m"
                        "memory" = "512Mi"
                    }
                    startup_cpu_boost = false
                }

                startup_probe {
                    failure_threshold     = 1
                    initial_delay_seconds = 0
                    period_seconds        = 240
                    timeout_seconds       = 240

                    tcp_socket {
                        port = 8888
                    }
                }
            }

            scaling {
                max_instance_count = 100
                min_instance_count = 0
            }
        }

        traffic {
            percent  = 100
            revision = null
            tag      = null
            type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.database-url.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "zaim"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "kanade0404"
      + secret_id             = "database-url"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
          + "service"                    = "zaim"
        }

      + replication {
          + auto {
            }
        }
    }

  # module.database-url.google_secret_manager_secret_version.secret-version will be created
  + resource "google_secret_manager_secret_version" "secret-version" {
      + create_time           = (known after apply)
      + deletion_policy       = "DELETE"
      + destroy_time          = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + is_secret_data_base64 = false
      + name                  = (known after apply)
      + secret                = (known after apply)
      + secret_data           = (sensitive value)
      + version               = (known after apply)
    }

Plan: 1 to import, 2 to add, 1 to change, 0 to destroy.
google_cloud_run_v2_service.app: Importing... [id=asia-northeast1/zaim-api]
google_cloud_run_v2_service.app: Import complete [id=asia-northeast1/zaim-api]
module.database-url.google_secret_manager_secret.secret: Creating...
module.database-url.google_secret_manager_secret.secret: Creation complete after 1s [id=projects/kanade0404/secrets/database-url]
module.database-url.google_secret_manager_secret_version.secret-version: Creating...
module.database-url.google_secret_manager_secret_version.secret-version: Creation complete after 0s [id=projects/137094135185/secrets/database-url/versions/1]
google_cloud_run_v2_service.app: Modifying... [id=projects/kanade0404/locations/asia-northeast1/services/zaim-api]
google_cloud_run_v2_service.app: Still modifying... [id=projects/kanade0404/locations/asia-northeast1/services/zaim-api, 10s elapsed]

Error: Error waiting for Updating Service: Error code 13, message: Revision 'zaim-api-00059-g7g' is not ready and cannot serve traffic. Image 'asia-northeast1-docker.pkg.dev/kanade0404/zaim-api/app' not found.

  with google_cloud_run_v2_service.app,
  on main.tf line 95, in resource "google_cloud_run_v2_service" "app":
  95: resource "google_cloud_run_v2_service" "app" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":43,"Program":"tfcmt","SHA1":"64c087dbd21bc6c71e704e146733f5d8bc300d1c","Vars":{},"WorkflowName":"Apply Terraform"} -->